
clear;clc;

% n=180; % 调度期的天数
% 
% % Muskingum Input
% Qingjiang=zeros(n,1);
% Chenglingji=zeros(n,1);
% Hanjiang=zeros(n,1);
% Qjj1=0; % 调度期第一天九江的初始流量

% % Lake Input
% station=2; % 鄱阳湖站点选择
% FiveRivers=ones(n,5)*1000;
% % Jiujiang=ones(n,1)*5000;
% Level0=18;

% save DataIn.mat


% % 水位约束插值
% n1=1:19;
% day1=[10 10 11 10 10 10 10 10 11 10 10 11 10 10 8 10 10 11];% 每旬的天数
% n2=zeros(1,19);% 每旬初的天数编号
% n2(1)=n1(1);
% for i=2:19
%     n2(i)=n2(i-1)+day1(i-1);
% end
% Zmin1=[145	147.48	149.93	152.97	155	157.24	160.51	162.26	163.26	164.02	163.84	163.61	162.91	161.5	160.28	159.34	158.17	157.06	156.19];
% Zmax1=[161.85	166.7	171.49	175	175	175	175	175	175	175	175	175	175	175	175	175	175	175	175];
% day2=[5 5 5 5 5 6, 5 5 5 5 5 5, 5 5 5 5 5 6, 5 5 5 5 5 6, 5 5 5 5 5 3, 5 5 5 5 5 6];% 每调度时段的天数
% n3=zeros(1,37);% 调度时段初天数的编号，共37个，最后一个为时段末的值
% n3(1)=n1(1);% 每时段初的天数编号
% for i=2:37
%     n3(i)=n3(i-1)+day2(i-1);
% end
% Zmin2=interp1(n2,Zmin1,n3)';
% Zmax2=interp1(n2,Zmax1,n3)';


% 常规调度水位插值
n=[1
35
84
120
150
161
261
302
365];
z=[175
170
155
155
154.8
145
145
175
175];
n4=(1:365)';% 每天的编号
z4=interp1(n,z,n4);
day2=[5 5 5 5 5 6, 5 5 5 5 5 5, 5 5 5 5 5 6];% 10-12月 每调度时段的天数
n3=zeros(1,19);% 调度时段初天数的编号，最后一个为时段末的值
n3(1)=274;% 每时段初的天数编号
for i=2:19
    n3(i)=n3(i-1)+day2(i-1);
end
z3=interp1(n,z,n3)';



